БухЭксп/Reports/РегламентированноеУведомлениеУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РегламентированноеУведомлениеУСН</Name>
		</Properties>
	</Report>
</MetaDataObject>

БухЭксп/Documents/УведомлениеОСпецрежимахНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОСпецрежимахНалогообложения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Reports/РегламентированноеУведомлениеУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает контейнер, который надо заполнять данными
//
// Параметры:
//    ИмяФормы - Строка - например, Форма2025_1
// Возвращаемое значение:
//    Структура - контейнер для заполнения ДОПП
//
Функция КонтейнерДляЗаполнения(ИмяФормы) Экспорт
	Если ИмяФормы = "Форма2025_1" Тогда
		Возврат КонтейнерДляЗаполнения_2025();
	Иначе
		ВызватьИсключение "Не поддерживаемый параметр";
	КонецЕсли;
КонецФункции

// Создание нового или редактирование существующего уведомления по УСН
//
// Параметры:
// Данные - Структура с полями:
//   Организация - СправочникСсылка.Организации
//   РегистрацияВИФНС - СправочникСсылка.РегистрацииВНалоговомОргане
//   Контейнер - Структура - получена из КонтейнерДляЗаполнения(...) и заполнена данными
//   Ссылка - ДокументСсылка.УведомлениеОСпецрежимахНалогообложения для редактирования существующего уведомления или Неопределено для создания нового
//   ДокументОснование - ОпределяемыйТип.ОснованиеУведомления или Неопределено
//   ИмяФормы - Строка - например, Форма2025_1
//
// Возвращаемое значение:
//    ДокументСсылка.УведомлениеОСпецрежимахНалогообложения ссылка на вновь созданное уведомление
Функция НовоеУведомлениеПоУСН(Данные) Экспорт 
	ИмяФормы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ИмяФормы");
	Если ИмяФормы = "Форма2025_1" Тогда
		Возврат НовоеУведомлениеПоУСН_2025(Данные);
	Иначе
		ВызватьИсключение "Не поддерживаемый параметр";
	КонецЕсли;
КонецФункции

// Определяет возможность печати pdf-417
//
//   ИмяФормы - Строка - например, Форма2025_1
//
// Возвращаемое значение:
//    Булево - истина, если возможна печать pdf-417
Функция ДоступнаПечатьPDF417(ИмяФормы) Экспорт
	Если ИмяФормы = "Форма2025_1" Тогда
		Возврат Истина;
	Иначе
		ВызватьИсключение НСтр("ru = 'Функция ДоступнаПечатьPDF417():
			|вызов функции с непредусмотренным значением параметра'");
	КонецЕсли;
КонецФункции

// Возвращает стандартную таблицу форм
//
// Возвращаемое значение:
//    ТаблицаЗначений - стандартная таблица с редакциями форм
Функция ТаблицаФормОтчета() Экспорт
	Результат = УведомлениеОСпецрежимахНалогообложения.НоваяТаблицаФормОтчета();
	
	НоваяФорма = Результат.Добавить();
	НоваяФорма.ФормаОтчета        = "Форма2025_1";
	НоваяФорма.ОписаниеОтчета     = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	НоваяФорма.РедакцияФормы      = "от 30.04.2026 № ЕД-1-3/285@";
	НоваяФорма.ДатаНачалоДействия = '20260731';
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьФормуПоУмолчанию() Экспорт
	Возврат "";
КонецФункции

Функция СформироватьСписокЛистов(Объект) Экспорт
	Если Объект.ИмяФормы = "Форма2025_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2025_1(Объект);
	КонецЕсли;
КонецФункции

Функция ПолучитьТаблицуПримененияФорматов() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуПримененияФорматов();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.КНД = "1154004";
	Стр.ВерсияФормата = "5.01";
	
	Возврат Результат;
КонецФункции

Функция ДанноеУведомлениеДоступноДляОрганизации() Экспорт 
	Возврат Истина;
КонецФункции

Функция ДанноеУведомлениеДоступноДляИП() Экспорт 
	Возврат Истина;
КонецФункции

Функция ПолучитьОсновнуюФорму() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьТаблицуФорм() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуФормУведомления();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеПоУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбОтказеОтУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбУтратеПраваНаУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПереходеНаУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПрекращенииДеятельностиПоУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2025_1";
	Стр.ОписаниеФормы = "В соответствии с приказом ФНС России от 30.04.2026 № ЕД-1-3/285@";
	Стр.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеПереходНПДУСН;
	Стр.ПутьФормы = "Отчет.РегламентированноеУведомлениеУСН.Форма.Форма2025_1";
	Стр.ДатаНачала = Дата('20260731');
	Стр.ДатаКонца = Дата('20990101');
	
	Возврат Результат;
КонецФункции

Функция СформироватьВыгрузкуИПолучитьДанные(ДокОбъект) Экспорт 
	Выгрузка = ДокОбъект.ВыгрузитьДокумент();
	Если Выгрузка = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	СтруктураВыгрузки = Новый Структура("ТестВыгрузки,КодировкаВыгрузки", Выгрузка[0].ТестВыгрузки, Выгрузка[0].КодировкаВыгрузки);
	
	Если ДокОбъект.ИмяФормы = "Форма2025_1" Тогда 
		СтруктураВыгрузки.Вставить("Данные", УведомлениеОСпецрежимахНалогообложения.ПолучитьМакетДвоичныхДанных(ДокОбъект.ИмяОтчета, "TIFF_2025_1"));
		СтруктураВыгрузки.Вставить("ИмяФайла", "1154004_5.01000_01.tif");
		Возврат СтруктураВыгрузки;
	КонецЕсли;
КонецФункции

Функция ЭлектронноеПредставление(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2025_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2025_1(Объект, УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт 
	Если ИмяФормы = "Форма2025_1" Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2025_1(
			УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления_Форма2025_1(СведенияОтправки)
	Префикс = "UT_PRIMUSN";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу_Форма2025_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	УведомлениеОСпецрежимахНалогообложения.ПроверкаАктуальностиФормыПриВыгрузке(
		Данные.Объект.ИмяФормы, ТаблицаОшибок, ПолучитьТаблицуФорм());
		
	УведомлениеОСпецрежимахНалогообложения.ПроверкаДатВУведомлении(Данные, ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложения.ПолнаяПроверкаЗаполненныхПоказателейНаСоотвествиеСписку(
		"СпискиВыбора2025_1", "СхемаВыгрузкиФорма2025_1", Данные.Объект.ИмяОтчета, ТаблицаОшибок, Данные);
	
	Титульная = Данные.ДанныеУведомления.Титульная;
	ЭтоЮЛ = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Данные.Организация);
	ПризнакОбязательности = Не (Титульная.ПрОснПрУвед = "1" И Титульная.ПрДатаПер = "2");
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаИНН(
		Титульная, ТаблицаОшибок, "Титульная", "ИНН", ПризнакОбязательности, ЭтоЮЛ);
	Если ЭтоЮЛ Тогда 
		УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКПП(
			Титульная, ТаблицаОшибок, "Титульная", "КПП", ПризнакОбязательности);
		Если Не ЗначениеЗаполнено(Титульная.НаимОрг) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано наименование организации", "Титульная", "НаимОрг"));
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Титульная.Фамилия) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана фамилия", "Титульная", "Фамилия"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.Имя) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указано имя", "Титульная", "Имя"));
		КонецЕсли;
		
		Если Не ПризнакОбязательности И Не ЗначениеЗаполнено(Титульная.ИНН) Тогда 
			Если ЗначениеЗаполнено(Титульная.ИдЕРН) Тогда
				Если Не СтрПодобнаПоРегулярномуВыражению(Титульная.ИдЕРН, "[0-9]{12}") Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Неправильно указан номер ЕРН", "Титульная", "ИдЕРН"));
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(Титульная.КодВидДок) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указан код документа", "Титульная", "КодВидДок"));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Титульная.СерНомДок) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указаны серия/номер документа", "Титульная", "СерНомДок"));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Титульная.ДатаРожд) Тогда 
					ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
						"Не указана дата рождения", "Титульная", "ДатаРожд"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Титульная.ПРИЗНАК_НП_ПОДВАЛ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак подписанта", "Титульная", "ПРИЗНАК_НП_ПОДВАЛ"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ДАТА_ПОДПИСИ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата подписи", "Титульная", "ДАТА_ПОДПИСИ"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаПодписантаНалоговойОтчетности(Данные, ТаблицаОшибок, "Титульная",
		(Титульная.ПРИЗНАК_НП_ПОДВАЛ = "1" И ЭтоЮЛ) Или Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2");
	Если Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2" И Не ЗначениеЗаполнено(Титульная.НаимДок) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан документ представителя", "Титульная", "НаимДок"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКодаНО(Титульная.КодНО, ТаблицаОшибок, "Титульная");
	
	Если Не ЗначениеЗаполнено(Титульная.ПрОснПрУвед) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан признак уведомления", "Титульная", "ПрОснПрУвед"));
	КонецЕсли;
	
	Если Титульная.ПрОснПрУвед = "1" Тогда 
		Если Не ЗначениеЗаполнено(Титульная.ПрДатаПер) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан признак даты перехода на УСН", "Титульная", "ПрДатаПер"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.ПрОбНал1) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан признак объекта налогообложения", "Титульная", "ПрОбНал1"));
		КонецЕсли;
		Если Титульная.ПрДатаПер = "1" Тогда 
			УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ГодПерех1", Истина, , 2000);
		КонецЕсли;
	ИначеЕсли Титульная.ПрОснПрУвед = "2" Тогда 
		Если Не ЗначениеЗаполнено(Титульная.ПрОбНал2) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан признак объекта налогообложения", "Титульная", "ПрОбНал2"));
		КонецЕсли;
		УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ГодПерех2", Истина, , 2000);
	ИначеЕсли Титульная.ПрОснПрУвед = "3" Тогда 
		УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ГодПерех3", Истина, , 2000);
	ИначеЕсли Титульная.ПрОснПрУвед = "4" Тогда 
		Если Не ЗначениеЗаполнено(Титульная.ДатаПрекр) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана/неправильно указана дата прекращения", "Титульная", "ДатаПрекр"));
		КонецЕсли;
	ИначеЕсли Титульная.ПрОснПрУвед = "6" Тогда 
		Если Не ЗначениеЗаполнено(Титульная.ПрУтрПримУСН) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан признак утраты права", "Титульная", "ПрУтрПримУСН"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Титульная.ДатаПер) Или Год(Титульная.ДатаПер) < 2000
			Или НачалоМесяца(Титульная.ДатаПер) <> Титульная.ДатаПер Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана / неправильно указана дата перехода на иной режим", "Титульная", "ДатаПер"));
		КонецЕсли;
		Если Титульная.ПрУтрПримУСН = "1" Тогда 
			Если Не ЗначениеЗаполнено(Титульная.Период1) Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Не указан период", "Титульная", "Период1"));
			КонецЕсли;
			УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ОтчетГод1", Истина, , 2000);
		ИначеЕсли Титульная.ПрУтрПримУСН = "2" Тогда 
			Если Не ЗначениеЗаполнено(Титульная.Период2) Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Не указан период", "Титульная", "Период2"));
			КонецЕсли;
			УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ОтчетГод2", Истина, , 2000);
			Если Не ЗначениеЗаполнено(Титульная.НомППункт) Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Не указан подпункт", "Титульная", "НомППункт"));
			КонецЕсли;
		ИначеЕсли Титульная.ПрУтрПримУСН = "3" Тогда 
			Если Не ЗначениеЗаполнено(Титульная.Период3) Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Не указан период", "Титульная", "Период3"));
			КонецЕсли;
			УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаГода(Титульная, ТаблицаОшибок, "Титульная", "ОтчетГод3", Истина, , 2000);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаОшибок;
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления_Форма2025_1(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	Данные = Объект.ДанныеУведомления.Получить();
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления_Форма2025_1(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	ОсновныеСведения.Вставить("ПрОснПрУвед", Данные.ДанныеУведомления.Титульная.ПрОснПрУвед);
	ОсновныеСведения.Вставить("ПрУтрПримУСН", Данные.ДанныеУведомления.Титульная.ПрУтрПримУСН);
	ОсновныеСведения.Вставить("ПрДатаПер", Данные.ДанныеУведомления.Титульная.ПрДатаПер);
	
	Если ЗначениеЗаполнено(Данные.ДанныеУведомления.Титульная.ИНН) Тогда 
		ОсновныеСведения.Вставить("ФЛДанные", "1");
	ИначеЕсли ЗначениеЗаполнено(Данные.ДанныеУведомления.Титульная.ИдЕРН) Тогда 
		ОсновныеСведения.Вставить("ФЛДанные", "2");
	Иначе
		ОсновныеСведения.Вставить("ФЛДанные", "3");
	КонецЕсли;
	
	
	Возврат ОсновныеСведения;
КонецФункции

Функция ЭлектронноеПредставление_Форма2025_1(Объект, УникальныйИдентификатор)
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2025_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления_Форма2025_1(Объект, УникальныйИдентификатор);
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2025_1");
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда 
		УзелДоход9М = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(СтруктураВыгрузки,
			"Документ/УвПримУСН/ПерехУСН/Доход9М", "Код");
		УзелОстСтОснСр = УведомлениеОСпецрежимахНалогообложения.НайтиУзелВДеревеПоПути(СтруктураВыгрузки,
			"Документ/УвПримУСН/ПерехУСН/ОстСтОснСр", "Код");
		УзелДоход9М.Обязательность = "О";
		УзелОстСтОснСр.Обязательность = "О";
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Функция СформироватьСписокЛистовФорма2025_1(Объект) Экспорт
	Листы = Новый СписокЗначений;
	
	ПечатнаяФорма = УведомлениеОСпецрежимахНалогообложения.НовыйПустойЛист();
	СтруктураПараметров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ДанныеУведомления").Получить();
	Титульная = СтруктураПараметров.ДанныеУведомления.Титульная;
	ИННКПП = УведомлениеОСпецрежимахНалогообложения.ТиповаяСтруктураИННКППДляПечати(Объект, Титульная);
	
	Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда 
		Титульная.Вставить("НаимОрг", СокрЛП(Титульная["Фамилия"] + " " + Титульная["Имя"] + " " + Титульная["Отчество"]));
	КонецЕсли;
	
	НомСтр = 0;
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета,
		Титульная, НомСтр, "Печать_Форма2025_1_Титульная", ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	
	УведомлениеОСпецрежимахНалогообложения.НапечататьСтруктуру(Объект.ИмяОтчета,
		Титульная, НомСтр, "Печать_Форма2025_1_Лист2", ПечатнаяФорма, ИННКПП);
	УведомлениеОСпецрежимахНалогообложения.ПоложитьПФВСписокЛистов(Объект, Листы, ПечатнаяФорма, НомСтр);
	
	Возврат Листы;
КонецФункции

Функция ВидУведомленияПоПризнаку(Признак) Экспорт 
	Если Признак = "1" Тогда 
		Возврат Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПереходеНаУСН;
	ИначеЕсли Признак = "2" Тогда 
		Возврат Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН;
	ИначеЕсли Признак = "3" Тогда 
		Возврат Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбОтказеОтУСН;
	ИначеЕсли Признак = "4" Или Признак = "5" Тогда 
		Возврат Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОПрекращенииДеятельностиПоУСН;
	ИначеЕсли Признак = "6" Тогда 
		Возврат Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеОбУтратеПраваНаУСН;
	Иначе 
		Возврат Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.УведомлениеПоУСН;
	КонецЕсли;
КонецФункции

#Область СозданиеУведомления

Функция КонтейнерДляЗаполнения_2025()
	Контейнер = Новый Структура;
	Контейнер.Вставить("Титульная", Новый Структура);
	
	Макет = Отчеты["РегламентированноеУведомлениеУСН"].ПолучитьМакет("Титульная_2025_1").ПолучитьОбласть("ОсновнаяЧасть");
	Для Каждого Обл Из Макет.Области Цикл 
		Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
			И Обл.СодержитЗначение = Истина Тогда 
			Контейнер["Титульная"].Вставить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Контейнер;
КонецФункции

Функция НовоеУведомлениеПоУСН_2025(Параметры)
	ИмяОтчета = "РегламентированноеУведомлениеУСН";
	ИмяФормы = "Форма2025_1";
	
	ПараметрыОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПараметрыОтчета");
	
	Контейнер = КонтейнерДляЗаполнения(ИмяФормы);
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИмяОтчета, ИмяФормы, ПараметрыОтчета, Контейнер);
	
	Ссылка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Ссылка");
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Организация");
	РегистрацияВИФНС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "РегистрацияВИФНС");
	
	ДокументОбъект = ?(ЗначениеЗаполнено(Ссылка), 
		Ссылка.ПолучитьОбъект(),
		Документы.УведомлениеОСпецрежимахНалогообложения.СоздатьДокумент());
		
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.РегистрацияВИФНС = РегистрацияВИФНС;
	
	ДокументОбъект.ПодписантФамилия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПодписантФамилия");
	ДокументОбъект.ПодписантИмя = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПодписантИмя");
	ДокументОбъект.ПодписантОтчество = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПодписантОтчество");
	
	ДатаПодписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контейнер["Титульная"], "ДАТА_ПОДПИСИ");
	
	Если Не ЗначениеЗаполнено(ДатаПодписи) Тогда
		ДатаПодписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДокументОбъект.Дата = ДатаПодписи;
	ДокументОбъект.ДатаПодписи = ДатаПодписи;
	ДокументОбъект.Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументОснование");
	ДокументОбъект.ИмяОтчета = ИмяОтчета;
	ДокументОбъект.ИмяФормы = ИмяФормы;
	
	УИДТитульная = Новый УникальныйИдентификатор;
	ДеревоСтраниц = УведомлениеОСпецрежимахНалогообложения.ПустоеДеревоСтраницУведомления();
	
	Стр001 = ДеревоСтраниц.Строки.Добавить();
	Стр001.Наименование = "Основные данные";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Титульная_2025_1";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Титульная";
	
	Титульная = Контейнер["Титульная"];
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДеревоСтраниц", ДеревоСтраниц);
	СтруктураПараметров.Вставить("ДанныеУведомления", Новый Структура("Титульная", Титульная));
	СтруктураПараметров.Вставить("РазрешитьВыгружатьСОшибками", Ложь);
	СтруктураПараметров.Вставить("ИдентификаторыОбычныхСтраниц", Новый Структура("Титульная", УИДТитульная));
	СтруктураПараметров.Вставить("ДанныеМногостраничныхРазделов", Новый Структура);
	СтруктураПараметров.Вставить("ДанныеДопСтрокБД", Новый Структура);
	
	ДокументОбъект.ВидУведомления = ВидУведомленияПоПризнаку(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Титульная, "ПрОснПрУвед", ""));
	ДокументОбъект.ДанныеУведомления = Новый ХранилищеЗначения(СтруктураПараметров);
	ДокументОбъект.Записать();
	Возврат ДокументОбъект.Ссылка;
КонецФункции

#Конецобласти

#КонецОбласти

#КонецЕсли
